<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\GovernmentEntities;

class GovernmentEntitiesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        $entities = [
            ['name' => 'وزارة الداخلية', 'location' => 'دمشق - ساحة المرجة'],
            ['name' => 'وزارة العدل', 'location' => 'دمشق - المرجة'],
            ['name' => 'وزارة الصحة', 'location' => 'دمشق - المزة'],
            ['name' => 'وزارة التربية', 'location' => 'دمشق - المزة'],
            ['name' => 'وزارة التعليم العالي', 'location' => 'دمشق - الروضة'],
            ['name' => 'وزارة الكهرباء', 'location' => 'دمشق - أبو رمانة'],
            ['name' => 'وزارة المالية', 'location' => 'دمشق - ساحة المحافظة'],
            ['name' => 'وزارة الاقتصاد والتجارة الخارجية', 'location' => 'دمشق - البرامكة'],
            ['name' => 'وزارة الإدارة المحلية والبيئة', 'location' => 'دمشق - كفرسوسة'],
            ['name' => 'وزارة النقل', 'location' => 'دمشق - كفرسوسة'],
            ['name' => 'وزارة الاتصالات والتقانة', 'location' => 'دمشق - أبراج سورية'],
            ['name' => 'وزارة النفط والثروة المعدنية', 'location' => 'دمشق - العدوي'],
            ['name' => 'وزارة الأشغال العامة', 'location' => 'دمشق - المهاجرين'],
            ['name' => 'وزارة التجارة الداخلية وحماية المستهلك', 'location' => 'دمشق - الحميدية'],
            ['name' => 'وزارة الشؤون الاجتماعية والعمل', 'location' => 'دمشق - المزة'],

            ['name' => 'المؤسسة العامة للمياه', 'location' => 'دمشق - البرامكة'],
            ['name' => 'المؤسسة العامة للكهرباء', 'location' => 'دمشق - العدوي'],
            ['name' => 'المؤسسة السورية للتجارة', 'location' => 'دمشق - الصالحية'],
            ['name' => 'الهيئة العامة للاتصالات', 'location' => 'دمشق - المزة أوتستراد'],
            ['name' => 'الهيئة العامة للضرائب والرسوم', 'location' => 'دمشق - ساحة المحافظة'],
            ['name' => 'مديرية الهجرة والجوازات', 'location' => 'دمشق - الزبلطاني'],
            ['name' => 'مديرية المرور', 'location' => 'دمشق - حرستا'],
            ['name' => 'مديرية المصالح العقارية', 'location' => 'دمشق - العدوي'],
            ['name' => 'مديرية النفوس (السجل المدني)', 'location' => 'دمشق - القنوات'],
            ['name' => 'مديرية المصارف الحكومية', 'location' => 'دمشق - شارع النصر'],
            ['name' => 'شركة محروقات - سادكوب', 'location' => 'دمشق - القابون'],
        ];

        GovernmentEntities::insert($entities);
    }
}
